[
"Let me reveal a little bit about my background for all you curious friends out there.",
"I have had a great interest in fragrances for as long as I can remember. I have always consciously guided myself through olfaction. I love how frosty winter mornings bring out completely new aspects of scents in the air. I love the multitude of green fruity fragrances in a warm summer garden just after a rain. The scent of a handful of newly picked raspberries.",
"Fragrance is everywhere. It communicates, changes and plays with our mind and I keep getting fascinated by how big role scents actually has in life.",
"Through a life-long interest in fragrances, through studies in chemistry and physics, through studies in perfumery and fragrance, and with a longing to be an entrepreneur and an independent artist, perhaps it is not that difficult to understand how I ended up here, creating perfumes. This is how I get my release of creativity and expression. Before it was through music, writing, drawing and painting. Nowadays I create in my fragrance laboratory. Same same but different.",
"I love the laboration and the blending of fragrance material, the analysis and deeper creative thinking around each part of a scent. Every fragrance has multiple layers of expression where everything tells you something, from the first impressions to the last sensible notes. It is more than facinating to build up a molecular blend where structures and physics interact to play with countless minds in the end. In my laboratory and factory everything is meticulously controlled and blended by hand. Everything used is of highest possible grade and quality. There is absolutely no compromisses for me in this and I want you to feel it in everything I make.",
"My personal opinion is that perfumery is both an exact science and a free creative art form. In this artistic play with olfactive perception, with all the creative interpretations and recreations through chemistry and physics, there is of course important limits and measures to take to be consistent, clear and lawful. On the other hand, this scient falls flat without an artistic side to it. Consequently, in professional perfumery there is no art without science and there is no science without art. They must go hand in hand for me to succeed as a perfumer.",
"From first entering the perfume business it took me years to find out how I wanted to create and present my work, my concept, my own pieces of olfactory art. I took my time and time was indeed needed to truly find out what qualities I wanted to enhance and develop in my own line of products and what path I wanted to take in my work. From first entering the perfume business it took me years to find out how I wanted to create and present my work, my concept, my own pieces of olfactory art. I took my time and time was indeed needed to truly find out what qualities I wanted to enhance and develop in my own line of products and what path I wanted to take in my work.",
"When creating with true passion I believe the outcome of ones work gains a much higher value and in this way I believe that my passion for fragrances and my life in Sweden shines through my fragrances. I want to create fragrances that are unique, exciting and useful, and I want my perfumes to radiate high quality and clarity throughout. I want every creation to reveal my passion for artistry and fragrance.",
"Svensk Parfym is a unique concept of fine fragrances, inspired by Sweden, made in Sweden. Svensk Parfym is an interpretation of Sweden by scent, just as it is and as it once was. Its nature, landscapes, cultures, people, cities, villages, history, present and future, all inspire and contribute to this unique craftsmanship – perfumery, standing as good as it gets, with one leg in science and the other in artistry.",
"I hope you enjoy my creations as much as I do.",
"Henrik Lestréus",
"Perfumer"
]

